app/Models/Admin_Akademik/Model_tahun_ajaran.php

SELECT *
FROM `sm_tahun_ajaran`
WHERE `sm_tahun_ajaran`.`sekolah_kode` = '10001'
---
    public function getTahunAjaran()
    {
        $kelompok =  session()->get('sekolah_kode');
        $builder = $this->db->table('sm_tahun_ajaran');
        $builder->where('sm_tahun_ajaran.sekolah_kode', $kelompok);
        return $builder->get()->getResultArray();