app/Models/Admin_Akademik/Model_semester.php

SELECT `a`.*, `b`.*
FROM `sm_semester` `a`
LEFT JOIN `sm_tahun_ajaran` `b` ON `b`.`id_tahun_ajaran` = `a`.`tahun_ajaran_id`
WHERE `a`.`sekolah_kode` = '10001'
---
    public function getSemester()
    {
        $kelompok =  session()->get('sekolah_kode');
        $builder = $this->db->table('sm_semester a');
        $builder->select('a.*, b.*');
        $builder->join('sm_tahun_ajaran b', 'b.id_tahun_ajaran = a.tahun_ajaran_id', 'left');
        $builder->where('a.sekolah_kode', $kelompok);
        return $builder->get()->getResultArray();

SELECT *
FROM `sm_tahun_ajaran`
WHERE `sekolah_kode` = '10001'
---
    public function getTahunAjaran()
    {
        $kelompok =  session()->get('sekolah_kode');
        $builder = $this->db->table('sm_tahun_ajaran');
        $builder->where('sekolah_kode', $kelompok);
        return $builder->get()->getResultArray();