app/Controllers/AuthController.php

SELECT *
FROM `sm_users`
WHERE `email` = 'admin_sd_muhammadiyah0001@gmail.com'
 LIMIT 1
---
    public function loginProcess()
    {
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required|min_length[6]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $userModel = new UserModel();
        $user = $userModel->where('email', $this->request->getPost('email'))->first();