app/Models/Model_admin_kelas.php

    public function getBentukPendidikan()
    {
        $builder = $this->db->table('sm_bentuk_pendidikan');
        return $builder->get()->getResultArray();
---
SELECT *
FROM `sm_bentuk_pendidikan`

    public function getAll()
    {
        $kelompok =  session()->get('sekolah_kode');
        $builder = $this->db->table('sm_kelas');
        $builder->select('sm_kelas.*, sm_bentuk_pendidikan.bentuk_pendidikan'); // pilih kolom yang ingin diambil
        $builder->join(
            'sm_bentuk_pendidikan',
            'sm_bentuk_pendidikan.id_bentuk_pendidikan = sm_kelas.bentuk_pendidikan_id',
            'left'
        );
        $builder->where('sm_kelas.sekolah_kode', $kelompok);
        return $builder->get()->getResultArray();
---
SELECT `sm_kelas`.*, `sm_bentuk_pendidikan`.`bentuk_pendidikan`
FROM `sm_kelas`
LEFT JOIN `sm_bentuk_pendidikan` ON `sm_bentuk_pendidikan`.`id_bentuk_pendidikan` = `sm_kelas`.`bentuk_pendidikan_id`
WHERE `sm_kelas`.`sekolah_kode` = '10001'