app/Models/Model_admin_jabatan.php

    public function getAll()
    {
        $kelompok =  session()->get('sekolah_kode');
        $builder = $this->db->table('sm_jabatan');
        $builder->join('sm_sekolah', 'sm_sekolah.kode_sekolah = sm_jabatan.kode_sekolah', 'left');
        $builder->where('sm_jabatan.kode_sekolah', $kelompok);
        return $builder->get()->getResultArray();
---
SELECT *
FROM `sm_jabatan`
LEFT JOIN `sm_sekolah` ON `sm_sekolah`.`kode_sekolah` = `sm_jabatan`.`kode_sekolah`
WHERE `sm_jabatan`.`kode_sekolah` = '10001'

    public function getBentukJabatan()
    {
        $builder = $this->db->table('sm_jabatan');
        return $builder->get()->getResultArray();
---
SELECT *
FROM `sm_jabatan`