app/Models/Model_admin_siswa.php

    public function getBentukPendidikan()
    {
        $builder = $this->db->table('sm_bentuk_pendidikan');
        return $builder->get()->getResultArray();
---
SELECT *
FROM `sm_bentuk_pendidikan`

    public function getSiswa()
    {
        $kelompok =  session()->get('sekolah_kode');
        $builder = $this->db->table('sm_siswa');
        $builder->select('sm_siswa.*, sm_bentuk_pendidikan.bentuk_pendidikan, sm_kelas.nama_kelas, sm_users.*');
        $builder->join('sm_bentuk_pendidikan', 'sm_bentuk_pendidikan.id_bentuk_pendidikan = sm_siswa.bentuk_pendidikan_id', 'left');
        $builder->join('sm_kelas', 'sm_kelas.id_kelas = sm_siswa.kelas_id', 'left');
        $builder->join('sm_users', 'sm_users.kode_person = sm_siswa.nis', 'left');
        return $builder->get()->getResultArray();
---
SELECT `sm_siswa`.*, `sm_bentuk_pendidikan`.`bentuk_pendidikan`, `sm_kelas`.`nama_kelas`, `sm_users`.*
FROM `sm_siswa`
LEFT JOIN `sm_bentuk_pendidikan` ON `sm_bentuk_pendidikan`.`id_bentuk_pendidikan` = `sm_siswa`.`bentuk_pendidikan_id`
LEFT JOIN `sm_kelas` ON `sm_kelas`.`id_kelas` = `sm_siswa`.`kelas_id`
LEFT JOIN `sm_users` ON `sm_users`.`kode_person` = `sm_siswa`.`nis`

    public function getKelas()
    {
        $kelompok =  session()->get('sekolah_kode');
        $builder = $this->db->table('sm_kelas');
        $builder->select('sm_kelas.*, sm_bentuk_pendidikan.bentuk_pendidikan'); // pilih kolom yang ingin diambil
        $builder->join(
            'sm_bentuk_pendidikan',
            'sm_bentuk_pendidikan.id_bentuk_pendidikan = sm_kelas.bentuk_pendidikan_id',
            'left'
        );
        $builder->where('sm_kelas.sekolah_kode', $kelompok);
        return $builder->get()->getResultArray();
---
SELECT `sm_kelas`.*, `sm_bentuk_pendidikan`.`bentuk_pendidikan`
FROM `sm_kelas`
LEFT JOIN `sm_bentuk_pendidikan` ON `sm_bentuk_pendidikan`.`id_bentuk_pendidikan` = `sm_kelas`.`bentuk_pendidikan_id`
WHERE `sm_kelas`.`sekolah_kode` = '10001'

    public function getDetailSiswa($id_siswa)
    {
        $kelompok =  session()->get('sekolah_kode');
        $builder = $this->db->table('sm_siswa');
        $builder->select('sm_siswa.*, sm_bentuk_pendidikan.bentuk_pendidikan, sm_kelas.kelas, sm_users.*');
        $builder->join('sm_bentuk_pendidikan', 'sm_bentuk_pendidikan.id_bentuk_pendidikan = sm_siswa.bentuk_pendidikan_id', 'left');
        $builder->join('sm_kelas', 'sm_kelas.id_kelas = sm_siswa.kelas_id', 'left');
        $builder->join('sm_users', 'sm_users.kode_person = sm_siswa.nis', 'left');
        $builder->where('sm_users.sekolah_kode', $kelompok);
        $builder->where('sm_siswa.id_siswa', $id_siswa);
        return $builder->get()->getRowArray();
---
SELECT `sm_siswa`.*, `sm_bentuk_pendidikan`.`bentuk_pendidikan`, `sm_kelas`.`kelas`, `sm_users`.*
FROM `sm_siswa`
LEFT JOIN `sm_bentuk_pendidikan` ON `sm_bentuk_pendidikan`.`id_bentuk_pendidikan` = `sm_siswa`.`bentuk_pendidikan_id`
LEFT JOIN `sm_kelas` ON `sm_kelas`.`id_kelas` = `sm_siswa`.`kelas_id`
LEFT JOIN `sm_users` ON `sm_users`.`kode_person` = `sm_siswa`.`nis`
WHERE `sm_users`.`sekolah_kode` = '10001'
AND `sm_siswa`.`id_siswa` = '1'