app/Models/Model_admin_pegawai.php

    public function getAll()
    {
        $kelompok =  session()->get('sekolah_kode');
        $builder = $this->db->table('sm_pegawai');
        $builder->select('sm_pegawai.*, sm_users.*');
        $builder->join('sm_users', 'sm_users.kode_person = sm_pegawai.person_kode', 'left');
        $builder->where('sm_users.sekolah_kode', $kelompok);
        return $builder->get()->getResultArray();
---
SELECT `sm_pegawai`.*, `sm_users`.*, `sm_bentuk_pendidikan`.*, `sm_jabatan`.*
FROM `sm_pegawai`
LEFT JOIN `sm_users` ON `sm_users`.`kode_person` = `sm_pegawai`.`person_kode`
LEFT JOIN `sm_bentuk_pendidikan` ON `sm_bentuk_pendidikan`.`id_bentuk_pendidikan` = `sm_pegawai`.`bentuk_pendidikan_id`
LEFT JOIN `sm_jabatan` ON `sm_jabatan`.`id_jabatan` = `sm_pegawai`.`jabatan_id`
WHERE `sm_users`.`sekolah_kode` = '10001'